coordinator/src/resources/get_prescription_document_request.mustache

<?xml version="1.0" encoding="utf-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:wsa="http://schemas.xmlsoap.org/ws/2004/08/addressing" xmlns:hl7="urn:hl7-org:v3">
    <SOAP-ENV:Header>
        <wsa:MessageID>uuid:{{message_id}}</wsa:MessageID>
        <wsa:Action>urn:nhs:names:services:mmquery/GET_PRESCRIPTION_DOCUMENT_INUK01</wsa:Action>
        <wsa:To>https://mm-sync.national.ncrs.nhs.uk/syncservice-mm/mm</wsa:To>
        <wsa:From>
            <wsa:Address/>
        </wsa:From>
        <hl7:communicationFunctionRcv>
            <hl7:device>
                <hl7:id root="1.2.826.0.1285.0.2.0.107" extension="{{to_asid}}"/>
            </hl7:device>
        </hl7:communicationFunctionRcv>
        <hl7:communicationFunctionSnd>
            <hl7:device>
                <hl7:id root="1.2.826.0.1285.0.2.0.107" extension="{{from_asid}}"/>
            </hl7:device>
        </hl7:communicationFunctionSnd>
        <wsa:ReplyTo>
            <wsa:Address/>
        </wsa:ReplyTo>
    </SOAP-ENV:Header>
    <SOAP-ENV:Body>
        <GET_PRESCRIPTION_DOCUMENT_INUK01 xmlns="urn:hl7-org:v3">
            <id root="{{message_id}}"/>
            <creationTime value="20220711135728"/>
            <versionCode code="V3NPfIT4.2.00"/>
            <interactionId root="2.16.840.1.113883.2.1.3.2.4.12" extension="GET_PRESCRIPTION_DOCUMENT_INUK01"/>
            <processingCode code="P"/>
            <processingModeCode code="T"/>
            <acceptAckCode code="NE"/>
            <communicationFunctionRcv>
                <device classCode="DEV" determinerCode="INSTANCE">
                    <id root="1.2.826.0.1285.0.2.0.107" extension="{{to_asid}}"/>
                </device>
            </communicationFunctionRcv>
            <communicationFunctionSnd>
                <device classCode="DEV" determinerCode="INSTANCE">
                    <id root="1.2.826.0.1285.0.2.0.107" extension="{{from_asid}}"/>
                </device>
            </communicationFunctionSnd>
            <ControlActEvent classCode="CACT" moodCode="EVN">
               <author1 typeCode="AUT">
                    <AgentSystemSDS classCode="AGNT">
                        <agentSystemSDS classCode="DEV" determinerCode="INSTANCE">
                            <id root="1.2.826.0.1285.0.2.0.107" extension="{{from_asid}}"/>
                        </agentSystemSDS>
                    </AgentSystemSDS>
                </author1>
                <query>
                    <prescriptionId value="{{prescription_id}}" />
                    <documentKey value="{{document_key}}" />
                </query>
            </ControlActEvent>
        </GET_PRESCRIPTION_DOCUMENT_INUK01>
    </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
